# IPointCloudEngine Methods

---
The IPointCloudEngine type exposes the following members.
| Name| Description
---|---|---
| CreatePointCloudAccess|  Implement this method to construct the IPointCloudAccess interface for the point cloud designated by the identifier. This method is called once during the creation of a PointCloudType.
| Free|  Revit will call this method when done using the engine.
Top
#### Reference
IPointCloudEngine Interface
Autodesk.Revit.DB.PointClouds Namespace